namespace_keywords = {
    "기본정보": ["대학소개"],
    "연구 및 산학": ["연구현황", "연구기관", "연구윤리", "세미나 및 포럼", "산학협력 및 창업지원"],
    "학사정보": ["학사일정", "수강신청", "강의", "교육과정 및 학칙", "수업", "학적", "졸업요건", "학점교류", "복학 및 휴학", "비교과프로그램", "전공자율선택제", "요람 및 규정집", "학사자료실"],
    "등록 및 장학": ["등록금", "장학금 정보"],
    "교수 및 연구": ["교수진", "연구실 정보", "교내 연구 지원"],
    "시설 및 서비스": ["도서관", "강의실", "기숙사", "주차시설", "체육시설", "컴퓨터실", "스터디룸", "식당", "카페", "복합기 및 프린터기", "학생회 물품 대여", "무선인터넷", "셔틀버스", "은행", "우체국", "편의점"],
    "학생활동 및 동아리": ["중앙동아리", "학과소학회", "학생회", "공모전", "대외활동"],
    "복지 및 지원": ["아주365지원", "의료비 지원", "보건진료소", "학생상담", "장애학생지원실", "성평등 상담소", "인권 상담소", "병무 관련 정보"],
    "캠퍼스 생활": ["기숙사 생활"],
    "공지사항": ["일반공지", "장학공지"],
    "입학 및 교육": ["대학 입학", "대학원 입학", "부설교육"]
}
